trade_exp/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДополнительныеОтчетыИОбработки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="3c54d440-e908-43d6-a5cc-bb64620c82d7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1dd911-8ee1-407b-acae-10c85b74baf3">
    <name>Публикация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fdbbbf8b-dacf-436e-8d8b-1e2b8e854b17">
    <name>ИспользоватьДляФормыСписка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="66364cd4-aaa5-421d-96d6-3c283c14650d">
    <name>ИспользоватьДляФормыОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebef37c6-4808-4683-93be-036ce19cafd5">
    <name>Информация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="532637ef-be0d-4f42-9747-a88e17eb3def">
    <name>Версия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61127152-3e24-40b4-8a23-5eb6cae568ff">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad1142ed-183d-47a3-800c-997a3770e11e">
    <name>ИмяФайла</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ffd987e3-e8af-4d46-881e-1e312e74dbac">
    <name>ИмяОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="23a240a2-52ee-46ab-89d9-50dcee2cc8d2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7acd5f4d-55de-443c-a5e5-404b1e77d13f">
    <name>ВключитьОграниченияФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93e9c43a-d522-4b3f-8faa-3e0a83aa610e">
    <name>ТолькоНаБазеTrade</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="136703ac-c000-4bb3-b150-be3adc900fdb">
    <name>ВестиЛогирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0481bc65-6a32-46b9-ae87-993ba52a29a5">
    <name>Команды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c708f6e9-b7a0-4046-90f3-83527da7b872">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="00974661-42a8-46e7-9e21-6f9141d0fb48">
    <name>ПараметрыИОтборы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="315022f6-3549-4d2d-8ada-cdaf7148b493">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c27cc284-6d41-4dcc-a424-f5545e73c073">
      <name>Обязательный</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86a4432d-ae7d-40f5-bb5d-9f8157f2ff8f">
      <name>ЭтоПараметр</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="566340cb-bbfc-49cd-850d-dd5cbc126c44">
      <name>ПериодПараметра</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonForms/ФормаОтчета/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачала = Константы.ДатаНачалаОграниченияДоступаКОстаткам.Получить();
	ТекДата = ТекущаяДата();
	
	ОграничениеДоступаКДанным = ?(ДатаНачала <> Дата(1,1,1) И ТекДата > ДатаНачала, Истина, Ложь);
	
	Если ОграничениеДоступаКДанным И Не АльтерраОбщегоНазначения.ЕстьПравоПросмотраОстатков(Пользователи.ТекущийПользователь()) Тогда
		ПолучитьСтандартнуюСхемуКД();
	КонецЕсли;
	
	Элементы.ПерейтиКНастройкамДляТехническогоСпециалиста.Видимость = АльтерраОбщегоНазначения._ЕстьРоль("ДоступКНастройкамДляТехническогоСпециалистаВОтчетах");
КонецПроцедуры

&НаСервере
Процедура Док_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	МассивСтрок = СтрРазделить(ИмяФормы, ".");
	Если МассивСтрок[0] <> "ВнешнийОтчет" Тогда
		Возврат;
	КонецЕсли;	
	
	ВнешнийОтчет = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", МассивСтрок[1]);
	Если ВнешнийОтчет.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ВнешнийОтчет.ВключитьОграниченияФормирования Тогда
		Возврат;
	КонецЕсли;
	
	Если ВнешнийОтчет.ТолькоНаБазеTrade и НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref") <> "trade" Тогда
		Возврат;
	КонецЕсли;	
	
	ТЧПараметрыИОтборы = ВнешнийОтчет.ПараметрыИОтборы;
	ПараметрыИОтборы = АльтерраОбщегоНазначения.ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроек(Отчет.КомпоновщикНастроек);
	ЭлементыПользовательскихНастроек = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	МассивПараметров = Новый Массив;
	МассивОтборов = Новый Массив;
	
	Для Каждого СтрокаТЧ из ТЧПараметрыИОтборы Цикл
		Если СтрокаТЧ.Обязательный Тогда
			
			НайденныйЭлемент = ПараметрыИОтборы.Найти(СтрокаТЧ.Наименование, "Заголовок");
			
			Если НайденныйЭлемент = Неопределено Тогда
				Если СтрокаТЧ.ЭтоПараметр Тогда
					МассивПараметров.Добавить(СтрокаТЧ.Наименование);
				Иначе
					МассивОтборов.Добавить(СтрокаТЧ.Наименование);
				КонецЕсли;	
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЭлементПользовательскойНастройки Из ЭлементыПользовательскихНастроек Цикл
			
				Если ТипЗнч(ЭлементПользовательскойНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и СтрокаТЧ.ЭтоПараметр Тогда
					
					Если НЕ (ЭлементПользовательскойНастройки.Использование и ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение))
					 и ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = НайденныйЭлемент.ИдентификаторПользовательскойНастройки Тогда
						МассивПараметров.Добавить(НайденныйЭлемент.Заголовок);
						Отказ = Истина;
					КонецЕсли;
					
					Если ЭлементПользовательскойНастройки.Использование и ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение)
					 и ТипЗнч(ЭлементПользовательскойНастройки.Значение) = Тип("СтандартныйПериод")
					 и ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = НайденныйЭлемент.ИдентификаторПользовательскойНастройки Тогда	
					 
					 	ПараметрСтандартныйПериод = ЭлементПользовательскойНастройки.Значение;
						ДатаНачала = ПараметрСтандартныйПериод.ДатаНачала;
						ДатаОкончания = ПараметрСтандартныйПериод.ДатаОкончания;
						Если (ДатаОкончания - ДатаНачала)/(31*24*3600) > СтрокаТЧ.ПериодПараметра и СтрокаТЧ.ПериодПараметра > 0 Тогда  
							МассивПараметров.Добавить("параметр периода " + НайденныйЭлемент.Заголовок + " не более " + СтрокаТЧ.ПериодПараметра + " месяцев");
							Отказ = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
		
				Если ТипЗнч(ЭлементПользовательскойНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") и НЕ СтрокаТЧ.ЭтоПараметр Тогда
					
					Если НЕ (ЭлементПользовательскойНастройки.Использование и ЗначениеЗаполнено(ЭлементПользовательскойНастройки.ПравоеЗначение))
					 и ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = НайденныйЭлемент.ИдентификаторПользовательскойНастройки Тогда
					 	МассивОтборов.Добавить(НайденныйЭлемент.ЛевоеЗначениеСтрока);
						Отказ = Истина;
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
	
	Если Отказ Тогда
		Сообщение = "Чтобы сформировать отчет заполните:";
		Если МассивПараметров.Количество() > 0 Тогда
			Сообщение = Сообщение + Символы.ПС + "- параметры: " + СтрСоединить(МассивПараметров, ", ");
		КонецЕсли;
		Если МассивОтборов.Количество() > 0 Тогда
			Сообщение = Сообщение + Символы.ПС + "- отборы: " + СтрСоединить(МассивОтборов, ", ");
		КонецЕсли;	
		АльтерраОбщегоНазначения.СообщитьПользователю(, Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Перед("Сформировать")
Процедура Док_Сформировать()
	ЗаписатьОтборыВЛог();//Если надо

	НазваниеОтчета= Строка(НастройкиОтчета.ОтчетСсылка);
	НазваниеВарианта= Строка(НастройкиОтчета.ВариантСсылка);
	СтрокаОтборов= ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроекСерверСкращенные();
	
	ДопДанные = НазваниеВарианта + "; " + Символы.ПС + "Отборы: " + СтрокаОтборов;
	
	Префикс= "";
	Если НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref") <> "trade" Тогда
		Префикс= "test ";
	КонецЕсли;
	
	СФП_МаркерыКлиент.МаркерНачало(Префикс+"Отчет: "+НазваниеОтчета, "Вариант: "+ДопДанные);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроекСерверСкращенные()
	
	МассивПравыхЗначений = Новый Массив;
	ПараметрыИОтборы = АльтерраОбщегоНазначения.ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроек(Отчет.КомпоновщикНастроек);
	СтрокаПараметров = "";
	СтрокаОтборов = "";
	Для Каждого СтрокаТЗ Из ПараметрыИОтборы Цикл
		
		Если СтрокаТЗ.Использование Тогда
			
			ПравоеЗначение = СтрокаТЗ.ПравоеЗначение;
			Если ТипЗнч(СтрокаТЗ.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				МассивПравыхЗначений = ПравоеЗначение.ВыгрузитьЗначения();
				СтрокаПравоеЗначение = СтрСоединить(МассивПравыхЗначений, ",");
			Иначе
				СтрокаПравоеЗначение = Строка(ПравоеЗначение);
			КонецЕсли;	
			
			Если СтрокаТЗ.ЭтоПараметр Тогда
				Если ТипЗнч(СтрокаТЗ.ПравоеЗначение) = Тип("СтандартныйПериод") ИЛИ
					ТипЗнч(СтрокаТЗ.ПравоеЗначение) = Тип("Дата") Тогда
					СтрокаПараметров = СтрокаПараметров + СтрокаТЗ.Заголовок + "=" + СтрокаПравоеЗначение + ";" + Символы.ПС;
				Иначе
					СтрокаПараметров = СтрокаПараметров + СтрокаТЗ.Заголовок + ";" + Символы.ПС;
				КонецЕсли;
			Иначе
				//Сокращяем данные
				СтрокаОтборов = СтрокаОтборов + СтрокаТЗ.Заголовок + ";" + Символы.ПС;
				
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПараметров, 2);
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаОтборов, 2);
	СтрокаОбщая = СтрокаПараметров + ";" + Символы.ПС + СтрокаОтборов + ";";
		
	Возврат СтрокаОбщая;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроекСерверПолные()
	
	МассивПравыхЗначений = Новый Массив;
	ПараметрыИОтборы = АльтерраОбщегоНазначения.ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроек(Отчет.КомпоновщикНастроек);
	СтрокаПараметров = "";
	СтрокаОтборов = "";
	Для Каждого СтрокаТЗ Из ПараметрыИОтборы Цикл
		
		Если СтрокаТЗ.Использование Тогда
			
			ПравоеЗначение = СтрокаТЗ.ПравоеЗначение;
			Если ТипЗнч(СтрокаТЗ.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				МассивПравыхЗначений = ПравоеЗначение.ВыгрузитьЗначения();
				СтрокаПравоеЗначение = СтрСоединить(МассивПравыхЗначений, ",");
			Иначе
				СтрокаПравоеЗначение = Строка(ПравоеЗначение);
			КонецЕсли;	
			
			Если СтрокаТЗ.ЭтоПараметр Тогда
				СтрокаПараметров = СтрокаПараметров + СтрокаТЗ.Заголовок + " = """ + СтрокаПравоеЗначение + """;" + Символы.ПС;
			Иначе
				СтрокаОтборов = СтрокаОтборов + СтрокаТЗ.Заголовок + " " + Строка(СтрокаТЗ.ВидСравнения) 
				+ " """ + СтрокаПравоеЗначение + """;" + Символы.ПС;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПараметров, 2);
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаОтборов, 2);
	СтрокаОбщая = СтрокаПараметров + ";" + Символы.ПС + СтрокаОтборов + ";";
		
	Возврат СтрокаОбщая;
	
КонецФункции


// приостановлена
&НаСервере
Процедура ЗаписатьОтборыВЛог()  
	возврат;
	МассивСтрок = СтрРазделить(ИмяФормы, ".");
	Если МассивСтрок[0] <> "ВнешнийОтчет" Тогда
		Возврат;
	КонецЕсли;	
	
	ВнешнийОтчет = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", МассивСтрок[1]);
	Если Не ВнешнийОтчет.Пустая() И ВнешнийОтчет.ВестиЛогирование Тогда
		
		НазваниеОтчета= Строка(НастройкиОтчета.ОтчетСсылка);
		НазваниеВарианта= Строка(НастройкиОтчета.ВариантСсылка);
		
		СтрокаОтборовДляЛога= ПолучитьПараметрыИОтборыОтчетаПоКомпоновщикуНастроекСерверПолные();
		
		ДатаВФайл= Формат(НачалоНедели(ТекущаяДата()), "ДФ=dd-MM-yyyy");
		ФайлЛогов= "C:\Bitrix\Log\"+ДатаВФайл+"_Параметры_отчетов.txt";
		ТекДата= Строка(ТекущаяДата());
		ТекПользователь= Пользователи.ТекущийПользователь();
		
		Попытка
			ЗаписьТекста= Новый ЗаписьТекста(ФайлЛогов, КодировкаТекста.UTF8,, Истина);
			ЗаписьТекста.ЗаписатьСтроку(НазваниеОтчета+": ("+НазваниеВарианта+")");
			ЗаписьТекста.ЗаписатьСтроку(ТекДата + " ; "+ТекПользователь);
			ЗаписьТекста.ЗаписатьСтроку(СтрокаОтборовДляЛога);
			ЗаписьТекста.ЗаписатьСтроку("");
		Исключение
			ЗаписьЖурналаРегистрации("Запись лога отчетов", УровеньЖурналаРегистрации.Ошибка,, "Ошибка записи лога отчетов");
		КонецПопытки;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
&После("ПослеФормирования")
Процедура Док_ПослеФормирования(Результат, ПараметрыФормирования) Экспорт
	
	СФП_МаркерыКлиент.ЗавершитьМаркерАвтоНеГлобальный();
	
КонецПроцедуры	

&НаКлиенте
&ИзменениеИКонтроль("ПоказатьСписокВыбора")
Процедура Док_ПоказатьСписокВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Сведения = ОтчетыКлиент.СведенияОЭлементеНастройки(Отчет.КомпоновщикНастроек, Элемент.Имя);
	ОписаниеНастроек = Сведения.Описание;

	ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;

	ПараметрыВыбора = ОтчетыКлиентСервер.ПараметрыВыбора(
		Сведения.Настройки, ПользовательскиеНастройки, Сведения.Элемент);

	РасширенноеОписаниеТипов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства, "РасширенноеОписаниеТипов");

	ТипЗначения = Неопределено;
	Если РасширенноеОписаниеТипов <> Неопределено Тогда
		РасширенноеОписаниеТипа = РасширенноеОписаниеТипов[Сведения.Индекс];
		Если РасширенноеОписаниеТипа <> Неопределено Тогда
			ТипЗначения = РасширенноеОписаниеТипа.ОписаниеТиповДляФормы;
		КонецЕсли;
	КонецЕсли;

	Элемент.ДоступныеТипы = ОтчетыКлиент.ТипЗначенияОграниченныйСвязьюПоТипу(
		Сведения.Настройки, ПользовательскиеНастройки, Сведения.Элемент, ОписаниеНастроек, ТипЗначения);

	Если ТипЗнч(Сведения.ЭлементПользовательскойНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		ТекущееЗначение = Сведения.ЭлементПользовательскойНастройки.Значение;
	Иначе
		ТекущееЗначение = Сведения.ЭлементПользовательскойНастройки.ПравоеЗначение;
	КонецЕсли;

	ОтмеченныеЗначения = ОтчетыКлиентСервер.ЗначенияСписком(ТекущееЗначение);
	ДоступныеЗначения = ?(ОписаниеНастроек = Неопределено, Неопределено, ОписаниеНастроек.ДоступныеЗначения);

	Условие = ОтчетыКлиентСервер.УсловиеЭлементаНастройки(Сведения.ЭлементПользовательскойНастройки, ОписаниеНастроек);
	ВыборГруппИЭлементов = ОтчетыКлиент.ЗначениеТипаИспользованиеГруппИЭлементов(
		?(ОписаниеНастроек = Неопределено, Неопределено, ОписаниеНастроек.ВыборГруппИЭлементов), Условие);

	ЗначенияДляВыбора = ЗначенияДляВыбора(Элемент.СписокВыбора, Сведения.ЭлементПользовательскойНастройки, 
		Элемент.ДоступныеТипы, ДоступныеЗначения);

	ОграничиватьВыборУказаннымиЗначениями = ДоступныеЗначения <> Неопределено;

	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ЭлементПользовательскойНастройки", Сведения.ЭлементПользовательскойНастройки);
	ПараметрыОбработчика.Вставить("ОграничиватьВыборУказаннымиЗначениями", ОграничиватьВыборУказаннымиЗначениями);
	ПараметрыОбработчика.Вставить("ИмяЭлемента", Элемент.Имя);

	Обработчик = Новый ОписаниеОповещения("ЗавершитьВыборИзСписка", ЭтотОбъект, ПараметрыОбработчика);

	Если ОтчетыКлиент.ВыборПереопределен(ЭтотОбъект, Обработчик, Сведения.Описание, Элемент.ДоступныеТипы,
		ОтмеченныеЗначения, ПараметрыВыбора) Тогда
		Возврат;
	КонецЕсли;

	Если ОтчетыКлиент.ЭтоВыборОбъектовМетаданных(Элемент.ДоступныеТипы, ОтмеченныеЗначения, Обработчик) Тогда
		Возврат;
	КонецЕсли;
	#Вставка
		Если Элемент.Заголовок = "Номенклатура" Тогда
		
		ЗначениеОтбораТочки = ПроверитьОтборПоТочкеПересчета();
		
		Если ЗначениеЗаполнено(ЗначениеОтбораТочки) Тогда
			
			ЗначениеОтбораПоВидам = ПолучитьЗначениеОтбораПоТочке(ЗначениеОтбораТочки);
			
			Отбор = Новый Массив;
			Отбор.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ЗначениеОтбораПоВидам));
			ПараметрыВыбора = Новый ФиксированныйМассив(Отбор);
		КонецЕсли; 
		
	КонецЕсли; 
	#КонецВставки

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отмеченные", ОтмеченныеЗначения);
	ПараметрыОткрытия.Вставить("ОписаниеТипов", Элемент.ДоступныеТипы);
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбора", ЗначенияДляВыбора);
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбораЗаполнены", Элемент.СписокВыбора.Количество() > 0);
	ПараметрыОткрытия.Вставить("ОграничиватьВыборУказаннымиЗначениями", ОграничиватьВыборУказаннымиЗначениями);
	ПараметрыОткрытия.Вставить("Представление", Элемент.Заголовок);
	ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Массив(ПараметрыВыбора));
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ВыборГруппИЭлементов);
	ПараметрыОткрытия.Вставить("БыстрыйВыбор", ?(ОписаниеНастроек = Неопределено, Ложь, ОписаниеНастроек.БыстрыйВыбор));
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
	Контекст.Вставить("Обработчик", Обработчик);
	
	Если ОграничиватьВыборУказаннымиЗначениями Тогда
		ПоказатьСписокВыбораПродолжение(Неопределено, Контекст);
	Иначе
		ОтчетыКлиент.НачатьВыборПользователей(ЭтотОбъект,
			Элемент, Элемент.ДоступныеТипы, ОтмеченныеЗначения, ПараметрыВыбора, Обработчик,
			Новый ОписаниеОповещения("ПоказатьСписокВыбораПродолжение", ЭтотОбъект, Контекст));
	КонецЕсли;
	

КонецПроцедуры

#Область ЧтениеРегистровБезПрав
&НаСервере
Процедура ПолучитьСтандартнуюСхемуКД()
	
	Если СтрНайти(ЭтотОбъект.ИмяФормы, "БезОстатков") > 0 Тогда
	
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		Если СтрНайти(ЭтотОбъект.ИмяФормы, "БезОстатков") > 0 Тогда
			Схема = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		КонецЕсли;
		
		ОтчетОбъект.СхемаКомпоновкиДанных = Схема;
		АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
		Отчет.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		
		Элементы.ВсеНастройкиЕще.Видимость = Ложь;
		Элементы.СброситьНастройки.Видимость = Ложь;
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ВсеНастройки")
Процедура Док_ВсеНастройки(Команда)
	ПолныеПрава = ПроверитьПрава();
	Если Не ПолныеПрава И СтрНайти(ЭтотОбъект.ИмяФормы, "БезОстатков") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(Команда);
КонецПроцедуры

&НаСервере
Функция ПроверитьПрава()
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

#КонецОбласти 
	
#Область ТочкиПересчетаОбучение
&НаКлиенте
Функция ПроверитьОтборПоТочкеПересчета()
	
	Для каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СправочникСсылка.ТочкиПересчетаОбучение") Тогда
				Если Элемент.Использование Тогда
					Возврат Элемент.ПравоеЗначение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 

КонецФункции 

&НаСервере
Функция ПолучитьЗначениеОтбораПоТочке(Точки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение В(&Точки)";
	
	Запрос.УстановитьПараметр("Точки", Точки);
	Список = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Номенклатура)
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ОтобразитьЗаголовкиПериодов();	
КонецПроцедуры

&НаКлиенте
&После("ОбновитьЭлементыФормыНастроек")
Процедура Док_ОбновитьЭлементыФормыНастроек(ПараметрыОбновления)
	ОтобразитьЗаголовкиПериодов(Истина);
КонецПроцедуры

// вынужденная дороботка для отображения заголовков периодов
&НаКлиенте
Процедура ОтобразитьЗаголовкиПериодов(Заменять = Ложь)  
	Для Каждого ТекущийЭлемент Из Элементы Цикл   
		Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда  
			Если (ТекущийЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет ИЛИ Заменять) И СтрНайти(ТекущийЭлемент.Заголовок,"(дата начала)") > 0  Тогда   
				ТекущийЭлемент.Заголовок = Сред(ТекущийЭлемент.Заголовок,1, СтрНайти(ТекущийЭлемент.Заголовок,"(дата начала)")-1);
				ТекущийЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура Док_ОтчетТабличныйДокументВыборВместо(Элемент, Область, СтандартнаяОбработка)
	ОбработкаРасшифровки = Ложь;
	
	Если СтандартнаяОбработка Тогда
		ИнтеграцияПодсистемБСПКлиент.ПриОбработкеВыбораТабличногоДокумента(ЭтотОбъект, Элемент, Область, СтандартнаяОбработка);
		ОтчетыКлиентПереопределяемый.ОбработкаВыбораТабличногоДокумента(ЭтотОбъект, Элемент, Область, СтандартнаяОбработка);
	КонецЕсли;
	
	Если Не ОбработкаРасшифровки
		И СтандартнаяОбработка
		И ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		Если ПерейтиПоСсылке(Область.Текст) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Попытка
			ЗначениеРасшифровки = Область.Расшифровка;
		Исключение
			ЗначениеРасшифровки = Неопределено;
			// Для некоторых типов областей табличного документа (свойство ТипОбласти)
			// чтение расшифровки недоступно, поэтому делается попытка-исключение.
		КонецПопытки;
		
		Если ЗначениеРасшифровки <> Неопределено
			И ПерейтиПоСсылке(ЗначениеРасшифровки) Тогда
			
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Если ПерейтиПоСсылке(Область.Маска) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// -Альтерра+ Отмена вывода настроек колонки
	//Если Не ОбработкаРасшифровки
	//	И СтандартнаяОбработка Тогда 
	//	
	//	ВариантыОтчетовСлужебныйКлиент.ПоказатьКонтекстнуюНастройкуОтчета(ЭтотОбъект, Элемент, Область, СтандартнаяОбработка);
	//КонецЕсли;
	// -Альтерра- Отмена вывода настроек колонки
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПерейтиКНастройкамДляТехническогоСпециалиста(Команда) 
		
	ПараметрыФормы = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, ФормаПараметры, Истина);
	ПараметрыФормы.Вставить("КлючВарианта", Строка(КлючТекущегоВарианта));
	ПараметрыФормы.Вставить("Вариант", Отчет.КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("НастройкиОтчета", НастройкиОтчета);
	ПараметрыФормы.Вставить("ВариантНаименование", Строка(ОтчетНаименованиеТекущегоВарианта));
	ПараметрыФормы.Вставить("ИдентификаторЭлементаСтруктурыНастроек", Неопределено);
	ПараметрыФормы.Вставить("ИмяСтраницы", "СтраницаОтборы");
	ПараметрыФормы.Вставить("ПредставлениеВарианта", Строка(ОтчетНаименованиеТекущегоВарианта));
	ПараметрыФормы.Вставить("ВариантМодифицирован", Ложь);
	ПараметрыФормы.Вставить("ПользовательскиеНастройкиМодифицированы", ПользовательскиеНастройкиМодифицированы);
	
	ОткрытьФорму(
		НастройкиОтчета.ПолноеИмя + ".ФормаВарианта", 
		ПараметрыФормы, 
		ЭтаФорма);

КонецПроцедуры
